app/views/events/_comentario.html.erb

<%event.comments.order(data: :desc).map do |c|%>
---
SELECT "comments".* FROM "comments" WHERE "comments"."event_id" = ?  ORDER BY "comments"."data" DESC  [["event_id", 1]]

      <a class="pull-left" href="#">
        <p class="avatarComentarioImg"><%= image_tag  c.user.avatar.url(:thumb) if c.user.avatar.url.present? %></p>
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ?  ORDER BY "users"."id" ASC LIMIT 1  [["id", 2]]