app/views/events/_form_events.html.erb

SELECT "categories".* FROM "categories"
---
                      <div class="form-group collection_check_boxes row">
                        <%= f.collection_check_boxes(:category_ids, Category.all, :id, :icone) do |b| %>