app/views/events/_form.html.erb

    <div class="field">
      <%=f.collection_check_boxes(:category_ids, Category.all, :id, :titulo) %>
---
SELECT "categories".* FROM "categories"