app/views/events/index.html.erb

        <p class="pull-right">
            <% @categorias =  Category.all%>
            <% event.category_ids.each do |item| %>
---
SELECT "categories".* FROM "categories"
SELECT "categories".id FROM "categories" INNER JOIN "categories_events" ON "categories"."id" = "categories_events"."category_id" WHERE "categories_events"."event_id" = ?  [["event_id", 1]]

              <li>
                  <a href="#"><i class="fa fa-comments "></i><%=event.comments.count%> Comentários</a>
---
SELECT COUNT(*) FROM "comments" WHERE "comments"."event_id" = ?  [["event_id", 1]]