app/views/events/show.html.erb

SELECT "categories".* FROM "categories"
SELECT "categories".id FROM "categories" INNER JOIN "categories_events" ON "categories"."id" = "categories_events"."category_id" WHERE "categories_events"."event_id" = ?  [["event_id", 1]]
---
        <!-- ########## icones dos eventos ############-->
        <% @categoriasDetalhes =  Category.all%>
          <% @event.category_ids.each do |item| %>

SELECT "comments".* FROM "comments" WHERE "comments"."event_id" = ?  ORDER BY "comments"."data" DESC  [["event_id", 1]]
---
      <!-- Comment -->
      <%@event.comments.order(data: :desc).map do |c|%>

SELECT  "users".* FROM "users" WHERE "users"."id" = ?  ORDER BY "users"."id" ASC LIMIT 1  [["id", 3]]
---
            <a class="pull-left" href="#">
              <%= image_tag  c.user.avatar.url(:thumb) if c.user.avatar.url.present? %><br><br>