app/controllers/categories_controller.rb

  def create
    @category = Category.new(category_params)

    respond_to do |format|
      if @category.save
---
INSERT INTO "categories" ("titulo", "icone", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["titulo", "Estacionamento"], ["icone", "fa fa-car"], ["created_at", "2015-08-07 22:00:07.903136"], ["updated_at", "2015-08-07 22:00:07.903136"]]