app/controllers/comments_controller.rb

  def index
    @comments = Comment.all.order(data: :desc)
---
SELECT "comments".* FROM "comments"  ORDER BY "comments"."data" DESC

  def create
    @comment = current_user.comments.build(comment_params)
    @comment.data = DateTime.now;
    respond_to do |format|
      if @comment.save
---
INSERT INTO "comments" ("conteudo", "event_id", "user_id", "data", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)