app/controllers/euvou_controller.rb

UPDATE "events" SET "eu_vou_rating" = ?, "updated_at" = ? WHERE "events"."id" = ?  [["eu_vou_rating", 1], ["updated_at", "2015-08-07 19:42:25.656436"], ["id", 1]]
UPDATE "users" SET "pontuacao" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["pontuacao", 60], ["updated_at", "2015-08-07 19:42:25.489651"], ["id", 3]]
---
  def confirmation
    if @event.users.exclude?(current_user)
      @event.users << current_user
      @event.eu_vou_rating = @event.eu_vou_rating + 1
      respond_to do |format|
        if @event.save