app/controllers/events_controller.rb

  def index
    @events = Event.all.order(:eu_vou_rating)
---
SELECT "events".* FROM "events" WHERE (data >= '2015-08-03 13:04:35.669032')  ORDER BY "events"."eu_vou_rating" DESC

  def create
    @event = Event.new(event_params)
    @event.creator = current_user

    respond_to do |format|
      if @event.save
---
INSERT INTO "events" ("titulo", "descricao", "endereco", "avatar_file_name", "avatar_content_type", "avatar_file_size", "avatar_updated_at", "data", "creator_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)

  def update
    respond_to do |format|
      if @event.update(event_params)
---
UPDATE "events" SET "avatar_file_name" = ?, "avatar_file_size" = ?, "avatar_updated_at" = ?, "updated_at" = ? WHERE "events"."id" = ?  [["avatar_file_name", "alice-falling.jpg"], ["avatar_file_size", 12796], ["avatar_updated_at", "2015-08-24 18:07:41.365906"], ["updated_at", "2015-08-24 18:07:41.766931"], ["id", 2]]