app/views/events/custom/_carouseul.html.erb

SELECT  "events".* FROM "events" WHERE (data >= '2015-08-20 17:29:52.117453')  ORDER BY "events"."eu_vou_rating" DESC LIMIT 3
---
            <div u="slides" style="cursor: move; position: absolute; left: 0px; top: 0px; width: 1300px; height: 300px; overflow: hidden;">
              <% Event.ativos.order(eu_vou_rating: :desc).first(3).each do |event| %>